In [204]:
import pandas as pd
import numpy as np

In [205]:
df=pd.Series([1,2,3,10,20,30],index=[1,2,3,1,2,3])
agg=df.groupby(level=0)

In [206]:
agg.sum()

1    11
2    22
3    33
dtype: int64

In [207]:
agg.first()

1    1
2    2
3    3
dtype: int64

In [208]:
agg.last()

1    10
2    20
3    30
dtype: int64

In [209]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two','three','two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  1.800001  0.654096
1  bar    one  1.341790 -0.414798
2  foo    two  0.063640 -0.655657
3  bar  three -0.530739  1.967412
4  foo    two -0.375111 -0.248861
5  bar    two -0.727180  0.227896
6  foo    one -0.322147  0.350165
7  foo  three  0.395006  0.412320

In [210]:
df.groupby(['A']).groups

{'bar': Int64Index([1, 3, 5], dtype='int64'),
 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [211]:
df.groupby(['A','B']).groups

{('bar', 'one'): Int64Index([1], dtype='int64'),
 ('bar', 'three'): Int64Index([3], dtype='int64'),
 ('bar', 'two'): Int64Index([5], dtype='int64'),
 ('foo', 'one'): Int64Index([0, 6], dtype='int64'),
 ('foo', 'three'): Int64Index([7], dtype='int64'),
 ('foo', 'two'): Int64Index([2, 4], dtype='int64')}

In [212]:
len(df.groupby(['A','B']))

6

In [213]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [214]:
index=pd.MultiIndex.from_arrays(arrays,names=['first','second'])
s=pd.DataFrame({'A':[1,1,1,1,2,2,3,3],'B':np.random.randn(8)},index=index)
s

              A         B
first second
bar   one     1  0.754502
      two     1 -0.605020
baz   one     1  0.048667
      two     1 -0.501286
foo   one     2 -0.779453
      two     2  2.303870
qux   one     3  1.699961
      two     3 -0.309678

In [215]:
s.groupby(level=0).get_group('foo')

              A         B
first second
foo   one     2 -0.779453
      two     2  2.303870

In [216]:
s.groupby(level='first').get_group('foo')

              A         B
first second
foo   one     2 -0.779453
      two     2  2.303870

In [217]:
s.sum(level='first')

       A         B
first
bar    2  0.149482
baz    2 -0.452619
foo    4  1.524418
qux    6  1.390283

In [218]:
for i,j in s.groupby(level='first'):
    print(i)
    print(j)

bar
              A         B
first second
bar   one     1  0.754502
      two     1 -0.605020
baz
              A         B
first second
baz   one     1  0.048667
      two     1 -0.501286
foo
              A         B
first second
foo   one     2 -0.779453
      two     2  2.303870
qux
              A         B
first second
qux   one     3  1.699961
      two     3 -0.309678

In [219]:
s.groupby(level='first').size()

first
bar    2
baz    2
foo    2
qux    2
dtype: int64

In [220]:
s.groupby(['first','second'])[['B']].mean()

                     B
first second
bar   one     0.754502
      two    -0.605020
baz   one     0.048667
      two    -0.501286
foo   one    -0.779453
      two     2.303870
qux   one     1.699961
      two    -0.309678

In [221]:
df=pd.DataFrame(np.random.randn(5,5),index=['joe','steve','wes','jim','travis'],columns=list('abcde'))
df

               a         b         c         d         e
joe    -0.718976  0.118411  0.491049  0.816555 -0.041671
steve   0.728353 -1.087578  1.102775  0.140943  0.337490
wes     1.876189 -0.433201 -0.173509 -1.783854  0.069834
jim    -0.578228  0.155377 -0.008441 -1.027934  0.718977
travis -1.579315  0.586171 -0.493338 -0.967911 -0.291062

In [222]:
df.iloc[2,1:3]=np.nan

In [223]:
df

               a         b         c         d         e
joe    -0.718976  0.118411  0.491049  0.816555 -0.041671
steve   0.728353 -1.087578  1.102775  0.140943  0.337490
wes     1.876189       NaN       NaN -1.783854  0.069834
jim    -0.578228  0.155377 -0.008441 -1.027934  0.718977
travis -1.579315  0.586171 -0.493338 -0.967911 -0.291062

In [224]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [225]:
df_group=df.groupby(mapping,axis=1)
df_group.sum()

            blue       red
joe     1.307604 -0.642235
steve   1.243719 -0.021736
wes    -1.783854  1.946024
jim    -1.036375  0.296126
travis -1.461249 -1.284207

In [226]:
map_series=pd.Series(mapping)

In [227]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [228]:
map_series.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [229]:
df.groupby(mapping,axis=1).count()

        blue  red
joe        2    3
steve      2    3
wes        1    2
jim        2    3
travis     2    3

In [230]:
df.groupby(map_series,axis=1).count()

        blue  red
joe        2    3
steve      2    3
wes        1    2
jim        2    3
travis     2    3

# 通过函数进行分组

相较于字典或Series，Python函数在定义分组映射关系时可以更有创意且更为抽象。任何被当作分组键的函数都会在各个索引值上被调用一次，其返回值就会被用作分组名称。具体点说，以上一小节的示例df为例，其索引值为人名。假设你希望根据人名的长度进行分组，虽然可以求取一个字符串长度数组，但其实仅仅传入len函数就可以了

In [231]:
df.groupby(len).sum()#传入len，根据人名长度进行分组

          a         b         c         d         e
3  0.578986  0.273789  0.482609 -1.995233  0.747140
5  0.728353 -1.087578  1.102775  0.140943  0.337490
6 -1.579315  0.586171 -0.493338 -0.967911 -0.291062

将函数跟数组、列表、字典、Series混合使用也不是问题，因为任何东西最终都会被转换为数组：

In [232]:
key_list=['one','one','one','two','two']

In [233]:
df.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.718976  0.118411  0.491049 -1.783854 -0.041671
  two -0.578228  0.155377 -0.008441 -1.027934  0.718977
5 one  0.728353 -1.087578  1.102775  0.140943  0.337490
6 two -1.579315  0.586171 -0.493338 -0.967911 -0.291062


# 根据索引级别分组

层次化索引数据集最方便的地方就在于它能够根据索引级别进行聚合。要实现该目的，通过level关键字传入级别编号或名称即可：

In [234]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['city','tenor'])
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)
hier_df

city         US                            JP
tenor         1         3         5         1         3
0     -0.282108  0.004569  1.040264  0.076784 -1.382990
1     -1.560331 -1.101607  0.964196  0.992023  1.355199
2      1.623021 -0.490337  0.363612 -1.933460  3.544313
3     -0.280423 -0.302961 -1.641660 -1.457825 -1.215586

In [235]:
hier_df.groupby(level='city',axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

# 数据聚合

对于聚合，我指的是任何能够从数组产生标量值的数据转换过程。之前的例子中我已经用过一些，比如mean、count、min以及sum等。你可能想知道在GroupBy对象上调用mean()时究竟发生了什么。许多常见的聚合运算都有就地计算数据集统计信息的优化实现。然而，并不是只能使用这些方法。你可以使用自己发明的聚合也就运算，还可以调用分组对象上已经定义好的任何方法。例如，quantile可以计算Series或DataFrame列的样本分位数：

In [236]:
df=pd.DataFrame({'key2':['one','two','one','two','one'],'key1':list('aabba'),'data1':np.random.randn(5),'data2':np.random.randn(5)})
df

      data1     data2 key1 key2
0 -0.666480 -0.250004    a  one
1  0.490111 -0.398031    a  two
2  1.726619  1.614110    b  one
3  0.555165 -0.509942    b  two
4  0.025218  0.665024    a  one

In [237]:
grouped=df.groupby('key1')
grouped[['data1']].quantile(0.9)

0.9      data1
key1
a     0.397132
b     1.609473

In [238]:
grouped['data1'].quantile(0.9)

key1
a    0.397132
b    1.609473
Name: data1, dtype: float64

虽然quantile并没有明确地实现于GroupBy，但它是一个Series方法，所以这里是能用的。实际上，GroupBy会高效地对Series进行切片，然后对各片调用piece.quantile（0.9），最后这些结果组装成最终结果。

如果要使用你自己的聚合函数，只需将其传入aggregate或agg方法即可：

In [239]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [240]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.156591  1.063055
b     1.171454  2.124052

In [241]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.050384  0.581990 -0.666480 -0.320631  0.025218  0.257665
b      2.0  1.140892  0.828343  0.555165  0.848028  1.140892  1.433755

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.490111   3.0  0.005663  0.575800 -0.398031 -0.324017 -0.250004
b     1.726619   2.0  0.552084  1.501932 -0.509942  0.021071  0.552084


           75%       max
key1
a     0.207510  0.665024
b     1.083097  1.614110

In [242]:
df = pd.DataFrame({'A': [1, 1, 2, 2],
                   'B': [1, 2, 3, 4],
                   'C': np.random.randn(4)})
df

   A  B         C
0  1  1 -0.897460
1  1  2  0.545742
2  2  3 -0.719453
3  2  4 -1.341502

In [243]:
df.groupby(['A']).agg(min)

   B         C
A
1  1 -0.897460
2  3 -1.341502

In [244]:
df.groupby('A').apply(np.average,axis=1)

A
1    [0.367513403835, 1.18191412291]
2      [1.42684896353, 1.5528327988]
dtype: object

In [245]:
df.groupby('A').agg(np.average)

     B         C
A
1  1.5 -0.175859
2  3.5 -1.030477

In [246]:
df.groupby(['A']).get_group(2)

   A  B         C
2  2  3 -0.719453
3  2  4 -1.341502

# 面向列的多函数应用

我们已经看到，对Series或DataFrame列的聚合运算其实就是使用aggregate（使用自定义函数）或调用诸如mean、std之类的方法。然而，你可能希望对不同的列使用不同的聚合函数，或一次应用多个函数。其实这事也好办，我将通过一些示例进行讲解。首先，我根据sex和smoke对tips进行分组：

In [247]:
df=pd.read_csv(r'./datasets/tips.csv')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [248]:
df['tip_pct']=df['tip']/df['total_bill']
df.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

如果传入一组函数或函数名，得到的DataFrame的列就会以相应的函数命名

In [249]:
def peak_to_peak(arr):
    return arr.max()-arr.min()
df.groupby(['sex','smoker']).agg([np.mean,'std',peak_to_peak])

              total_bill                              tip            \
                    mean       std peak_to_peak      mean       std
sex    smoker
Female No      18.105185  7.286455        28.58  2.773519  1.128425
       Yes     17.977879  9.189751        41.23  2.931515  1.219916
Male   No      19.791237  8.726566        40.82  3.113402  1.489559
       Yes     22.284500  9.911845        43.56  3.051167  1.500120

                                size                          tip_pct  \
              peak_to_peak      mean       std peak_to_peak      mean
sex    smoker
Female No             4.20  2.592593  1.073146            5  0.156921
       Yes            5.50  2.242424  0.613917            3  0.182150
Male   No             7.75  2.711340  0.989094            4  0.160669
       Yes            9.00  2.500000  0.892530            4  0.152771


                    std peak_to_peak
sex    smoker
Female No      0.036421     0.195876
       Yes     0.071595     0.360233
Male   No      0.041849     0.220186
       Yes     0.090588     0.674707

如你所见，结果DataFrame拥有层次化的列，这相当于分别对各列进行聚合，然后用concat将结果组装到一起（列名用做keys参数）。

In [250]:
df.groupby(['sex','smoker'])['tip_pct'].agg(['mean',np.std,peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

你并非一定要接受GroupBy自动给出的那些列名，特别是lambda函数，它们的名称是”<#lambda>“这样的辨识度就下降了（通过函数的name属性看看就知道了）。<table><tr><td bgcolor=red>如果传入的是一个由（name，function）元组组成的列表，则各元组的第一个元素就会被用作DataFrame的列名<\td><\tr><\table>（可以将这种二元元组列表看做一个有序映射）：

In [251]:
df.groupby(['sex','smoker'])['tip_pct'].agg([('foo','mean'),('bar',np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

<table><tr><td bgcolor=red>现在，假设你想要对不同的列应用不同的函数。具体的办法是向agg传入一个从列名映射到函数的字典<\td><\tr><\table>

In [252]:
df.groupby(['sex','smoker']).agg({'tip':np.max,'size':'sum','day':'count'})

                tip  size  day
sex    smoker
Female No       5.2   140   54
       Yes      6.5    74   33
Male   No       9.0   263   97
       Yes     10.0   150   60

<table><tr><td bgcolor=red>也可对一列进行多个函数的操作

In [253]:
df.groupby(['sex','smoker']).agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

只有将多个函数应用到至少一列时，DataFrame才会拥有层次化的列

# 以”无索引“的形式返回聚合数据

到目前为止，所有示例中的聚合数据都有由唯一的分组键组成的索引（可能还是层次化的）。由于并不总是需要如此，所以你可以向groupby传入as_index=False以禁用该功能：

In [254]:
df.groupby(['sex','smoker'],as_index=False).mean()

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

In [255]:
df.groupby(['sex','smoker'],as_index=True).mean()

               total_bill       tip      size   tip_pct
sex    smoker
Female No       18.105185  2.773519  2.592593  0.156921
       Yes      17.977879  2.931515  2.242424  0.182150
Male   No       19.791237  3.113402  2.711340  0.160669
       Yes      22.284500  3.051167  2.500000  0.152771

当然，对结果调用reset_index也能得到这种形式的结果
<table >警告：groupby的这种用法比较缺少灵活性

# 分组级运算和转换

聚合只不过是分组运算的其中一种而已。它是数据转换的一个特例，也就是说，它接受能够将一维数组简化为标量值的函数。以下介绍transform和apply 方法，它能够执行更多其他的分组运算

假设我们想要为一个DataFrame添加一个用于存放各索引分组平均值的列。<table><tr><td bgcolor=red>一个方法是先聚合再合并：

In [256]:
import pandas as pd,numpy as np
df=pd.DataFrame({'data1':np.random.randn(5),'data2':np.random.randn(5),'key1':list('aabba'),'key2':['one','two','one','two','one']})
df#默认是按照columns排好序的

      data1     data2 key1 key2
0 -0.091535  1.409290    a  one
1 -0.504740 -1.563877    a  two
2 -0.108040  1.074755    b  one
3  0.137129  0.877637    b  two
4  0.664502 -0.016154    a  one

In [257]:
k1_means=df.groupby('key1').mean().add_prefix('mean_')
k1_means

      mean_data1  mean_data2
key1
a       0.022742   -0.056914
b       0.014544    0.976196

In [258]:
pd.merge(df,k1_means,left_on='key1',right_on='key2',right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0 -0.091535  1.409290    a  one    0.022742   -0.056914
1 -0.504740 -1.563877    a  two    0.022742   -0.056914
4  0.664502 -0.016154    a  one    0.022742   -0.056914
2 -0.108040  1.074755    b  one    0.014544    0.976196
3  0.137129  0.877637    b  two    0.014544    0.976196

虽然这样也行，但是不太灵活。你可以将该过程看做是利用np.mean函数对两个数据列进行转换。再以本章前面用过的那个people DataFrame为例，这次我们在GroupBy上使用transform方法：

In [259]:
key=['one','two','one','two','one']

In [260]:
people=pd.DataFrame(np.random.randn(5,5),columns=list('abcde'),index=['joe','steve','wes','jim','travis'])
print(people)
people.groupby(key).mean()

               a         b         c         d         e
joe    -0.427085 -1.164246 -0.467547 -0.286078 -0.200355
steve  -0.359028 -0.129926  1.184958  1.078574 -0.032495
wes     0.342529  0.632170 -1.701461  0.337797  0.760480
jim     0.434362 -0.206844  0.390225 -0.578682  0.639473
travis -0.541446  0.909996 -0.075985 -0.592957  0.213048

            a         b         c         d         e
one -0.208667  0.125973 -0.748331 -0.180413  0.257724
two  0.037667 -0.168385  0.787592  0.249946  0.303489

In [261]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
joe    -0.208667  0.125973 -0.748331 -0.180413  0.257724
steve   0.037667 -0.168385  0.787592  0.249946  0.303489
wes    -0.208667  0.125973 -0.748331 -0.180413  0.257724
jim     0.037667 -0.168385  0.787592  0.249946  0.303489
travis -0.208667  0.125973 -0.748331 -0.180413  0.257724

不难看出，<table><tr><td bgcolor=red>transform会将一个函数应用到各个分组，然后将结果放置到适当的位置上。如果各分组产生的是一个标量值，则该值就会被广播出去。<\table><\tr><\td>

现在，假设你希望从各组中减去平均值。为此，我们先创建一个距平化函数（demeaning function），然后将其传给transform:

In [262]:
def demean(arr):
    return arr-arr.mean()
demeaned=people.groupby(key).transform(demean)
demeaned

               a         b         c         d         e
joe    -0.218418 -1.290219  0.280784 -0.105665 -0.458080
steve  -0.396695  0.038459  0.397366  0.828628 -0.335984
wes     0.551196  0.506196 -0.953130  0.518210  0.502756
jim     0.396695 -0.038459 -0.397366 -0.828628  0.335984
travis -0.332779  0.784023  0.672346 -0.412544 -0.044676

In [263]:
demeaned.groupby(key).mean()

       a             b             c    d             e
one  0.0 -3.700743e-17 -7.401487e-17  0.0  1.850372e-17
two  0.0  0.000000e+00  0.000000e+00  0.0 -2.775558e-17

分组距平化操作还可以通过apply实现

# apply：一般性的‘拆分-应用-合并’

根aggregate一样，transform也是一个有着严格条件的特殊函数：传入的函数只能产生两种结果，要么产生一个可以广播的标量值（np.mean),要么产生一个相同大小的结果数组。最一般化的GroupBy方法是apply，apply会将待处理的对象拆分成多个片段，然后对各片段调用传入的函数，最后尝试将各个片段组合到一起。

回到之前的那个小费数据集，假设你想要根据分组选出最高的5个tip_pct值。首先，编写一个选取指定的列具有最大值的行的函数：

In [264]:
df=pd.read_csv('./datasets/tips.csv')
df.head()
df['tip_pct']=df["tip"]/df["total_bill"]
df.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [265]:
def top(df,n=5,column='tip_pct'):
    return df.sort_values(by=column,ascending=False)[:n]
top(df,n=6)
df.sort_values(by=['tip_pct'],ascending=False)[:6]

     total_bill   tip     sex smoker  day    time  size   tip_pct
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525

现在，如果对smoker分组并用该函数调用apply，就会得到：

In [266]:
df.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525

<table><td bgcolor=red>top函数在DataFrame的各个片段上调用，然后结果由pandas。concat组装到一起，并以分组名称进行了标记。于是，最终结果就有了一个层次化索引，其内层索引值来自原DataFrame。

如果传给apply的函数能够接受其他参数或关键字，则可以将这些内容放在函数名后面一并传入：

In [267]:
df.groupby(['smoker','day']).apply(top,n=1,column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [268]:
df.sort_values(by='tip_pct',ascending=False).groupby('smoker').get_group('No').head()

     total_bill   tip     sex smoker   day    time  size   tip_pct
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746

In [269]:
result=df.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [270]:
result.unstack(level=0).unstack(level=1)#result.unstack(level='smoker').unstack('smoker')

smoker          No        Yes
count   151.000000  93.000000
mean      0.159328   0.163196
std       0.039910   0.085119
min       0.056797   0.035638
25%       0.136906   0.106771
50%       0.155625   0.153846
75%       0.185014   0.195059
max       0.291990   0.710345

在Groupby中，当你调用诸如describe之类的方法时，实际上只是应用了下面两条代码的快捷方式而已：

<table><td bgcolor=red> f=lambda x:x.describe()
<table>grouped.apply(f)

# 禁止分组键

从上面的例子可以看出，分组会跟原始对象的索引共同构成结果对象中的层次化索引。将group_keys=Fasle传入groupby即可禁止该效果：

In [271]:
df.groupby('smoker',group_keys=False).apply(top).sort_values(by='tip_pct',ascending=False)

     total_bill   tip     sex smoker   day    time  size   tip_pct
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746

# 分位数和桶分析

pandas有一些能根据指定面元或样本分位数将数据拆分成多块的工具（比如cut和qcut）。将这些函数跟groupby结合起来，就能非常轻松地实现对数据集的桶（bucker)或分位数（quantile)分析了，以下这个简单的随机数据集为例，我们利用cut将其装入长度相等的桶中：

In [277]:
frame=pd.DataFrame({'data1':np.random.randn(1000),'data2':np.random.randn(1000)})
factor=pd.cut(frame.data1,4)
factor[:10]

0    (-1.955, -0.0607]
1     (-0.0607, 1.834]
2    (-1.955, -0.0607]
3     (-0.0607, 1.834]
4    (-1.955, -0.0607]
5    (-1.955, -0.0607]
6     (-0.0607, 1.834]
7    (-1.955, -0.0607]
8    (-1.955, -0.0607]
9    (-1.955, -0.0607]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.857, -1.955] < (-1.955, -0.0607] < (-0.0607, 1.834] < (1.834, 3.728]]

由cut返回的Factor对象可直接用于groupby。因此，我们可以像下面这样对data2做一些统计计算：

In [278]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),'count':group.count(),'mean':group.mean()}
grouped=frame.data2.groupby(factor)
grouped.apply(get_stats).unstack(level=1).sort_values('count',ascending=False)

                   count       max      mean       min
data1
(-0.0607, 1.834]   478.0  2.496689  0.002632 -3.086647
(-1.955, -0.0607]  455.0  2.766971  0.029405 -2.704008
(1.834, 3.728]      38.0  2.943702  0.180825 -2.335289
(-3.857, -1.955]    29.0  1.761439 -0.091874 -1.264146

这些都是长度相等的桶（指的是区间大小相等）。要根据样本分位数得到大小相等的桶(指的是数据点数量相等)，使用qcut即可。传入labels=False即可只获取分位数的编号。

In [289]:
#返回分位数编号
grouping=pd.qcut(frame.data1,10,labels=False)

In [290]:
grouped=frame.data2.groupby(grouping)

In [288]:
grouped.apply(get_stats).unstack(level=1)

       count       max      mean       min
data1
0      100.0  2.201925 -0.018855 -1.996102
1      100.0  2.690991 -0.100962 -1.945000
2      100.0  2.089728 -0.020952 -2.704008
3      100.0  2.411746 -0.002037 -2.400861
4      100.0  2.766971  0.205792 -3.086647
5      100.0  2.496689  0.021682 -2.891501
6      100.0  2.452431  0.083536 -2.531417
7      100.0  2.298353 -0.008573 -2.537218
8      100.0  2.211757 -0.042787 -2.972346
9      100.0  2.943702  0.071600 -2.449269

# 用特定于分组的值填充缺失值